In [2]:
import pandas as pd
import numpy as np

In [6]:
from numpy.random import randn

In [ ]:
np.random.seed(101)

In [7]:
df = pd.DataFrame(randn(5,4), ['A', 'B', 'C','D','E'], columns =['W', 'X','Y', 'Z'])

In [8]:
df

          W         X         Y         Z
A -0.289174  0.041070 -0.156501  0.436272
B -0.945742  0.891961 -1.119784 -0.032008
C  0.501005  1.724642  1.496860  0.126786
D -0.652826  0.827446 -0.307630 -1.270591
E -0.590577 -0.105617 -0.395297 -0.676483

In [9]:
df > 0

       W      X      Y      Z
A  False   True  False   True
B  False   True  False  False
C   True   True   True   True
D  False   True  False  False
E  False  False  False  False

In [10]:
df[df>0]

          W         X        Y         Z
A       NaN  0.041070      NaN  0.436272
B       NaN  0.891961      NaN       NaN
C  0.501005  1.724642  1.49686  0.126786
D       NaN  0.827446      NaN       NaN
E       NaN       NaN      NaN       NaN

In [14]:
df[df['W']>0]

          W         X        Y         Z
C  0.501005  1.724642  1.49686  0.126786

In [15]:
df[df['W']>0]['X']

C    1.724642
Name: X, dtype: float64

In [18]:
df[(df['W']>0)  | (df['Y']<0)]

          W         X         Y         Z
A -0.289174  0.041070 -0.156501  0.436272
B -0.945742  0.891961 -1.119784 -0.032008
C  0.501005  1.724642  1.496860  0.126786
D -0.652826  0.827446 -0.307630 -1.270591
E -0.590577 -0.105617 -0.395297 -0.676483

In [19]:
df[(df['W']>0)  & (df['Y']<0)]

Empty DataFrame
Columns: [W, X, Y, Z]
Index: []

In [24]:
new = 'CA NY WY OR CO '.split()
new

['CA', 'NY', 'WY', 'OR', 'CO']

In [25]:
df['states'] = new

In [26]:
df

          W         X         Y         Z states
A -0.289174  0.041070 -0.156501  0.436272     CA
B -0.945742  0.891961 -1.119784 -0.032008     NY
C  0.501005  1.724642  1.496860  0.126786     WY
D -0.652826  0.827446 -0.307630 -1.270591     OR
E -0.590577 -0.105617 -0.395297 -0.676483     CO

In [28]:
df.set_index('states')

               W         X         Y         Z
states
CA     -0.289174  0.041070 -0.156501  0.436272
NY     -0.945742  0.891961 -1.119784 -0.032008
WY      0.501005  1.724642  1.496860  0.126786
OR     -0.652826  0.827446 -0.307630 -1.270591
CO     -0.590577 -0.105617 -0.395297 -0.676483

In [29]:
df.reset_index()

  index         W         X         Y         Z states
0     A -0.289174  0.041070 -0.156501  0.436272     CA
1     B -0.945742  0.891961 -1.119784 -0.032008     NY
2     C  0.501005  1.724642  1.496860  0.126786     WY
3     D -0.652826  0.827446 -0.307630 -1.270591     OR
4     E -0.590577 -0.105617 -0.395297 -0.676483     CO

In [30]:
df

          W         X         Y         Z states
A -0.289174  0.041070 -0.156501  0.436272     CA
B -0.945742  0.891961 -1.119784 -0.032008     NY
C  0.501005  1.724642  1.496860  0.126786     WY
D -0.652826  0.827446 -0.307630 -1.270591     OR
E -0.590577 -0.105617 -0.395297 -0.676483     CO